/**
 * Created by Orlovskiy on 24.12.2016.
 */
public class Appication {

    public static void main(String args[]) {

        //1. При помощи цикла for вывести на экран нечетные числа от 1 до 99.
       
        First.print();

        // 2. Дано число n. При помощи цикла for посчитать факториал n!
        Second.print();

        // 3. Перепишите программы с использованием цикла while.
        Third.print();

        /* 4. Создайте массив из всех нечётных чисел от 1 до 99,
         * выведите его на экран в строку, а затем этот же массив выведите
         * на экран тоже в строку, но в обратном порядке (99 97 95 93 … 7 5 3 1).
         */
        Fourth.print();

        // 5. Создайте массив из 20-ти первых чисел Фибоначчи и выведите его на экран
        Fifth.print();

        /* 6. Создать двумерный массив из 8 строк по 5 столбцов в каждой из случайных
         * целых чисел из отрезка *10;99+. Вывести массив на экран.
         */
        Sixth.print();

         }
}
